[
  {
    "text": "Betty Boop is going public domain! This is bigger than just cartoons. How will this wave of newly available content fuel AI training & remix culture, especially in Asia's vibrant digital art scene? What new business models will emerge?",
    "timestamp": "2026-01-02T03:53:40.857Z",
    "url": "https://x.com/lmanchu/status/2006936868953403419",
    "source": "news-pipeline"
  },
  {
    "text": "A grim future. This isn't about the politics, it's about the societal decay fueled by online hate. Tech's supposed to connect us, not accelerate our collapse. We need to rethink content moderation before 2025 is reality.",
    "timestamp": "2026-01-02T04:15:32.216Z",
    "url": "https://x.com/lmanchu/status/2006942368411598906",
    "source": "news-pipeline"
  },
  {
    "text": "Nintendo's Switch 2 dominating 2025 already? Shows the power of understanding your market. Hardware isn't dead, just needs the right ecosystem. Asian tech giants take note: build experiences, not just specs.",
    "timestamp": "2026-01-02T04:15:58.594Z",
    "url": "https://x.com/lmanchu/status/2006942482786054622",
    "source": "news-pipeline"
  },
  {
    "text": "Cybersecurity pros turned ransomware criminals? Irony is dead. This highlights the critical need for internal controls & vetting. Who's watching the watchers? Is your vendor secure? #cybersecurity #ransomware",
    "timestamp": "2026-01-02T04:16:32.086Z",
    "url": "https://x.com/lmanchu/status/2006942482786054622",
    "source": "news-pipeline"
  },
  {
    "text": "Instagram's head admits reality is blurring. We're entering an era where seeing isn't believing. How do we build trust in a world of infinite synthetic content? Time to explore decentralized verification solutions.",
    "timestamp": "2026-01-02T04:16:58.756Z",
    "url": "https://x.com/lmanchu/status/2006942734045876665",
    "source": "news-pipeline"
  },
  {
    "text": "Net neutrality's on-again, off-again status is terrible for business. How can startups plan for the future when the rules of the internet are constantly changing? This uncertainty stifles innovation and hurts competition. Time to demand clarity.",
    "timestamp": "2026-01-03T01:15:32.419Z",
    "url": "https://x.com/lmanchu/status/2007259459782095135",
    "source": "news-pipeline"
  }
]